askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDA.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDA.bootloader.OSCCFG=0x00
AVRDA.bootloader.PINCFG=0x00
AVRDA.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}00{bootloader.eesave_bit}
AVRDA.bootloader.SYSCFG1=0b000{bootloader.mvsys_bit}000
AVRDA.bootloader.CODESIZE=0x00
AVRDA.bootloader.BOOTSIZE=0x01
AVRDA.bootloader.bod_lvl=000
AVRDA.bootloader.bod_mode=00
AVRDA.bootloader.bod_sample=0
AVRDA.bootloader.eepupload=
AVRDA.bootloader.browupload=
AVRDA.bootloader.urowupload=
AVRDA.bootloader.fuseupload={bootloader.fuses}
AVRDA.bootloader.eesave_bit=1
AVRDA.bootloader.mvsys_bit=01
AVRDA.bootloader.reset_bit=1
AVRDA.bootloader.updi_bit=1
AVRDA.bootloader.tool=avrdude
AVRDA.bootloader.programed_type=.with_bootloader
AVRDA.build.export_merged_output=true
AVRDA.build.text_section_start=.text=0x200
AVRDA.build.buildopt=-DNDEBUG
AVRDA.build.console_baud=-DCONSOLE_BAUD=9600
AVRDA.build.macroapi=-DENABLE_MACRO_API
AVRDA.build.printf=
AVRDA.build.printflt=
AVRDA.build.f_cpu=24000000L
AVRDA.compiler.ldflags=
AVRDA.compiler.c.elf.extra_flags=
AVRDA.upload.protocol=arduino
AVRDA.upload.speed=115200
AVRDA.upload.tool=avrdude
AVRDA.menu.01_variant.01_AVR128DA64.build.board=AVR_AVR128DA64
AVRDA.menu.01_variant.01_AVR128DA64.build.mcu=avr128da64
AVRDA.menu.01_variant.01_AVR128DA64.build.variant=avr_da64
AVRDA.menu.01_variant.01_AVR128DA64.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.01_AVR128DA64.upload.maximum_data_size=16384
AVRDA.menu.01_variant.01_AVR128DA64.upload.maximum_size=130560
AVRDA.menu.01_variant.01_AVR128DA64=64pin AVR128DA64 (128KiB+16KiB)
AVRDA.menu.01_variant.02_AVR128DA64S.build.board=AVR_AVR128DA64S
AVRDA.menu.01_variant.02_AVR128DA64S.build.mcu=avr128da64s
AVRDA.menu.01_variant.02_AVR128DA64S.build.variant=avr_da64
AVRDA.menu.01_variant.02_AVR128DA64S.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.02_AVR128DA64S.upload.maximum_data_size=16384
AVRDA.menu.01_variant.02_AVR128DA64S.upload.maximum_size=130560
AVRDA.menu.01_variant.02_AVR128DA64S=64pin AVR128DA64S (128KiB+16KiB)
AVRDA.menu.01_variant.03_AVR64DA64.build.board=AVR_AVR64DA64
AVRDA.menu.01_variant.03_AVR64DA64.build.mcu=avr64da64
AVRDA.menu.01_variant.03_AVR64DA64.build.variant=avr_da64
AVRDA.menu.01_variant.03_AVR64DA64.build.linker_script=avrxmega2_p512.x
AVRDA.menu.01_variant.03_AVR64DA64.upload.maximum_data_size=8192
AVRDA.menu.01_variant.03_AVR64DA64.upload.maximum_size=65024
AVRDA.menu.01_variant.03_AVR64DA64=64pin AVR64DA64 (64KiB+8KiB)
AVRDA.menu.01_variant.10_separator=-
AVRDA.menu.01_variant.11_AVR128DA48.build.board=AVR_AVR128DA48
AVRDA.menu.01_variant.11_AVR128DA48.build.mcu=avr128da48
AVRDA.menu.01_variant.11_AVR128DA48.build.variant=avr_da48
AVRDA.menu.01_variant.11_AVR128DA48.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.11_AVR128DA48.upload.maximum_data_size=16384
AVRDA.menu.01_variant.11_AVR128DA48.upload.maximum_size=130560
AVRDA.menu.01_variant.11_AVR128DA48=48pin AVR128DA48 (128KiB+16KiB)
AVRDA.menu.01_variant.12_AVR128DA48S.build.board=AVR_AVR128DA48S
AVRDA.menu.01_variant.12_AVR128DA48S.build.mcu=avr128da48s
AVRDA.menu.01_variant.12_AVR128DA48S.build.variant=avr_da48
AVRDA.menu.01_variant.12_AVR128DA48S.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.12_AVR128DA48S.upload.maximum_data_size=16384
AVRDA.menu.01_variant.12_AVR128DA48S.upload.maximum_size=130560
AVRDA.menu.01_variant.12_AVR128DA48S=48pin AVR128DA48S (128KiB+16KiB)
AVRDA.menu.01_variant.13_AVR64DA48.build.board=AVR_AVR64DA48
AVRDA.menu.01_variant.13_AVR64DA48.build.mcu=avr64da48
AVRDA.menu.01_variant.13_AVR64DA48.build.variant=avr_da48
AVRDA.menu.01_variant.13_AVR64DA48.build.linker_script=avrxmega2_p512.x
AVRDA.menu.01_variant.13_AVR64DA48.upload.maximum_data_size=8192
AVRDA.menu.01_variant.13_AVR64DA48.upload.maximum_size=65024
AVRDA.menu.01_variant.13_AVR64DA48=48pin AVR64DA48 (64KiB+8KiB)
AVRDA.menu.01_variant.14_AVR32DA48.build.board=AVR_AVR32DA48
AVRDA.menu.01_variant.14_AVR32DA48.build.mcu=avr32da48
AVRDA.menu.01_variant.14_AVR32DA48.build.variant=avr_da48
AVRDA.menu.01_variant.14_AVR32DA48.build.linker_script=avrxmega3_p512.x
AVRDA.menu.01_variant.14_AVR32DA48.upload.maximum_data_size=4096
AVRDA.menu.01_variant.14_AVR32DA48.upload.maximum_size=32256
AVRDA.menu.01_variant.14_AVR32DA48=48pin AVR32DA48 (32KiB+4KiB)
AVRDA.menu.01_variant.20_separator=-
AVRDA.menu.01_variant.21_AVR128DA32.build.board=AVR_AVR128DA32
AVRDA.menu.01_variant.21_AVR128DA32.build.mcu=avr128da32
AVRDA.menu.01_variant.21_AVR128DA32.build.variant=avr_da32
AVRDA.menu.01_variant.21_AVR128DA32.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.21_AVR128DA32.upload.maximum_data_size=16384
AVRDA.menu.01_variant.21_AVR128DA32.upload.maximum_size=130560
AVRDA.menu.01_variant.21_AVR128DA32=32pin AVR128DA32 (128KiB+16KiB)
AVRDA.menu.01_variant.22_AVR128DA32S.build.board=AVR_AVR128DA32S
AVRDA.menu.01_variant.22_AVR128DA32S.build.mcu=avr128da32s
AVRDA.menu.01_variant.22_AVR128DA32S.build.variant=avr_da32
AVRDA.menu.01_variant.22_AVR128DA32S.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.22_AVR128DA32S.upload.maximum_data_size=16384
AVRDA.menu.01_variant.22_AVR128DA32S.upload.maximum_size=130560
AVRDA.menu.01_variant.22_AVR128DA32S=32pin AVR128DA32S (128KiB+16KiB)
AVRDA.menu.01_variant.23_AVR64DA32.build.board=AVR_AVR64DA32
AVRDA.menu.01_variant.23_AVR64DA32.build.mcu=avr64da32
AVRDA.menu.01_variant.23_AVR64DA32.build.variant=avr_da32
AVRDA.menu.01_variant.23_AVR64DA32.build.linker_script=avrxmega2_p512.x
AVRDA.menu.01_variant.23_AVR64DA32.upload.maximum_data_size=8192
AVRDA.menu.01_variant.23_AVR64DA32.upload.maximum_size=65024
AVRDA.menu.01_variant.23_AVR64DA32=32pin AVR64DA32 (64KiB+8KiB)
AVRDA.menu.01_variant.24_AVR32DA32.build.board=AVR_AVR32DA32
AVRDA.menu.01_variant.24_AVR32DA32.build.mcu=avr32da32
AVRDA.menu.01_variant.24_AVR32DA32.build.variant=avr_da32
AVRDA.menu.01_variant.24_AVR32DA32.build.linker_script=avrxmega3_p512.x
AVRDA.menu.01_variant.24_AVR32DA32.upload.maximum_data_size=4096
AVRDA.menu.01_variant.24_AVR32DA32.upload.maximum_size=32256
AVRDA.menu.01_variant.24_AVR32DA32=32pin AVR32DA32 (32KiB+4KiB)
AVRDA.menu.01_variant.30_separator=-
AVRDA.menu.01_variant.31_AVR128DA28.build.board=AVR_AVR128DA28
AVRDA.menu.01_variant.31_AVR128DA28.build.mcu=avr128da28
AVRDA.menu.01_variant.31_AVR128DA28.build.variant=avr_da28
AVRDA.menu.01_variant.31_AVR128DA28.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.31_AVR128DA28.upload.maximum_data_size=16384
AVRDA.menu.01_variant.31_AVR128DA28.upload.maximum_size=130560
AVRDA.menu.01_variant.31_AVR128DA28=28pin AVR128DA28 (128KiB+16KiB)
AVRDA.menu.01_variant.32_AVR128DA282.build.board=AVR_AVR128DA28S
AVRDA.menu.01_variant.32_AVR128DA282.build.mcu=avr128da28s
AVRDA.menu.01_variant.32_AVR128DA282.build.variant=avr_da28
AVRDA.menu.01_variant.32_AVR128DA282.build.linker_script=avrxmega4_p512.x
AVRDA.menu.01_variant.32_AVR128DA282.upload.maximum_data_size=16384
AVRDA.menu.01_variant.32_AVR128DA282.upload.maximum_size=130560
AVRDA.menu.01_variant.32_AVR128DA282=28pin AVR128DA28S (128KiB+16KiB)
AVRDA.menu.01_variant.33_AVR64DA28.build.board=AVR_AVR64DA28
AVRDA.menu.01_variant.33_AVR64DA28.build.mcu=avr64da28
AVRDA.menu.01_variant.33_AVR64DA28.build.variant=avr_da28
AVRDA.menu.01_variant.33_AVR64DA28.build.linker_script=avrxmega2_p512.x
AVRDA.menu.01_variant.33_AVR64DA28.upload.maximum_data_size=8192
AVRDA.menu.01_variant.33_AVR64DA28.upload.maximum_size=65024
AVRDA.menu.01_variant.33_AVR64DA28=28pin AVR64DA28 (64KiB+8KiB)
AVRDA.menu.01_variant.34_AVR32DA28.build.board=AVR_AVR32DA28
AVRDA.menu.01_variant.34_AVR32DA28.build.mcu=avr32da28
AVRDA.menu.01_variant.34_AVR32DA28.build.variant=avr_da28
AVRDA.menu.01_variant.34_AVR32DA28.build.linker_script=avrxmega3_p512.x
AVRDA.menu.01_variant.34_AVR32DA28.upload.maximum_data_size=4096
AVRDA.menu.01_variant.34_AVR32DA28.upload.maximum_size=32256
AVRDA.menu.01_variant.34_AVR32DA28=28pin AVR32DA28 (32KiB+4KiB)
AVRDA.menu.02_clock.01_24MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.01_24MHz.build.f_cpu=24000000L
AVRDA.menu.02_clock.01_24MHz=Internal 24 MHz (default)
AVRDA.menu.02_clock.01_12MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.01_12MHz.build.f_cpu=12000000L
AVRDA.menu.02_clock.01_12MHz=Internal 12 MHz
AVRDA.menu.02_clock.03_6MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.03_6MHz.build.f_cpu=6000000L
AVRDA.menu.02_clock.03_6MHz=Internal 6 MHz
AVRDA.menu.02_clock.04_3MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.04_3MHz.build.f_cpu=3000000L
AVRDA.menu.02_clock.04_3MHz=Internal 3 MHz
AVRDA.menu.02_clock.10_separator=-
AVRDA.menu.02_clock.11_20MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.11_20MHz.build.f_cpu=20000000L
AVRDA.menu.02_clock.11_20MHz=Internal 20 MHz
AVRDA.menu.02_clock.12_10MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.12_10MHz.build.f_cpu=10000000L
AVRDA.menu.02_clock.12_10MHz=Internal 10 MHz
AVRDA.menu.02_clock.13_5MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.13_5MHz.build.f_cpu=5000000L
AVRDA.menu.02_clock.13_5MHz=Internal 5 MHz
AVRDA.menu.02_clock.20_separator=-
AVRDA.menu.02_clock.21_16MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.21_16MHz.build.f_cpu=16000000L
AVRDA.menu.02_clock.21_16MHz=Internal 16 MHz
AVRDA.menu.02_clock.22_8MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.22_8MHz.build.f_cpu=8000000L
AVRDA.menu.02_clock.22_8MHz=Internal 8 MHz
AVRDA.menu.02_clock.23_4MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.23_4MHz.build.f_cpu=4000000L
AVRDA.menu.02_clock.23_4MHz=Internal 4 MHz
AVRDA.menu.02_clock.24_2MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.24_2MHz.build.f_cpu=2000000L
AVRDA.menu.02_clock.24_2MHz=Internal 2 MHz
AVRDA.menu.02_clock.25_1MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.25_1MHz.build.f_cpu=1000000L
AVRDA.menu.02_clock.25_1MHz=Internal 1 MHz
AVRDA.menu.02_clock.30_separator=-
AVRDA.menu.02_clock.31_32MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.31_32MHz.build.f_cpu=32000000L
AVRDA.menu.02_clock.31_32MHz=Internal 32 MHz (OVERCLOCK)
AVRDA.menu.02_clock.32_28MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.32_28MHz.build.f_cpu=28000000L
AVRDA.menu.02_clock.32_28MHz=Internal 28 MHz (OVERCLOCK)
AVRDA.menu.02_clock.33_14MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.33_14MHz.build.f_cpu=14000000L
AVRDA.menu.02_clock.33_14MHz=Internal 14 MHz (OVERCLOCK)
AVRDA.menu.02_clock.34_7MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.34_7MHz.build.f_cpu=7000000L
AVRDA.menu.02_clock.34_7MHz=Internal 7 MHz (OVERCLOCK)
AVRDA.menu.02_clock.40_separator=-
AVRDA.menu.02_clock.41_32768Hz.bootloader.bod_sample=1
AVRDA.menu.02_clock.41_32768Hz.build.f_cpu=32768
AVRDA.menu.02_clock.41_32768Hz=Internal 32.768 kHz (ULP)
# AVRDA.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
# AVRDA.menu.11_BODMODE.01_disabled=BOD Disabled
# AVRDA.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
# AVRDA.menu.11_BODMODE.02_enabled=BOD Enabled
# AVRDA.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
# AVRDA.menu.11_BODMODE.03_sampled=BOD Sampled
# AVRDA.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
# AVRDA.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
# AVRDA.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRDA.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRDA.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRDA.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRDA.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRDA.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRDA.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRDA.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVRDA.menu.21_resetpin.01_reset.bootloader.reset_bit=1
AVRDA.menu.21_resetpin.01_reset=Reset
AVRDA.menu.21_resetpin.02_gpio.bootloader.reset_bit=0
AVRDA.menu.21_resetpin.02_gpio=GPIO (input only)
AVRDA.menu.24_eeprom.01_keep.bootloader.eesave_bit=1
AVRDA.menu.24_eeprom.01_keep=Save guard "Retained"
AVRDA.menu.24_eeprom.02_erase.bootloader.eesave_bit=0
AVRDA.menu.24_eeprom.02_erase=Save guard "Erase"
AVRDA.menu.24_eeprom.03_upload.bootloader.eepupload={bootloader.eeprom}
AVRDA.menu.24_eeprom.03_upload.bootloader.eesave_bit=1
AVRDA.menu.24_eeprom.03_upload=Upload ".eep" file
AVRDA.menu.26_userrow.02_keep=Save guard "Retained"
AVRDA.menu.26_userrow.03_upload.bootloader.urowupload={bootloader.userrow}
AVRDA.menu.26_userrow.03_upload=Upload ".urow" file
AVRDA.menu.51_buildopt.01_Release=Build Release (default)
AVRDA.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRDA.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRDA.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRDA.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRDA.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRDA.menu.52_macroapi.02_Withoutboot.compiler.ldflags=-nostartfiles -DWOSFILES=1
AVRDA.menu.52_macroapi.02_Withoutboot=Macro API Enable without startup
AVRDA.menu.52_macroapi.03_Disable.build.macroapi=
AVRDA.menu.52_macroapi.03_Disable=Macro API Disable
AVRDA.menu.52_macroapi.04_AllDisable.build.macroapi=
AVRDA.menu.52_macroapi.04_AllDisable.compiler.ldflags=-nostartfiles -nostdlib -DWOSFILES=1 -DWOSTDLIB=1
AVRDA.menu.52_macroapi.04_AllDisable=Standard Library All Disable
AVRDA.menu.53_printf.01_default=default
AVRDA.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRDA.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDA.menu.53_printf.02_full=Float Support
AVRDA.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDA.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVRDA.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDA.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVRDA.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDA.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVRDA.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDA.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVRDA.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDA.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVRDA.menu.90_console_baud.14_500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDA.menu.90_console_baud.14_500000bps=CONSOLE_BAUD=500000 bps
AVRDA.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDA.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVRDA.menu.90_console_baud.20_separator=-
AVRDA.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDA.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVRDA.menu.95_bootloader.01_UART0_A0_LA7.bootloader.file=hex/boot_avrdx_UART0_A0_{upload.speed}_LA7.hex
AVRDA.menu.95_bootloader.01_UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRDA.menu.95_bootloader.01_UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7
AVRDA.menu.95_bootloader.10_separator=-
AVRDA.menu.95_bootloader.11_UART2_F0_LA7.bootloader.file=hex/boot_avrdx_UART2_F0_{upload.speed}_LA7.hex
AVRDA.menu.95_bootloader.11_UART2_F0_LA7.build.console_select=-DSerial=Serial2A -DLED_BUILTIN=PIN_PA7
AVRDA.menu.95_bootloader.11_UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7
AVRDA.menu.95_bootloader.12_UART2_F4_LA7.bootloader.file=hex/boot_avrdx_UART2_F4_{upload.speed}_LA7.hex
AVRDA.menu.95_bootloader.12_UART2_F4_LA7.build.console_select=-DSerial=Serial2B -DLED_BUILTIN=PIN_PA7
AVRDA.menu.95_bootloader.12_UART2_F4_LA7=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48/64pin)
AVRDA.menu.95_bootloader.20_separator=-
AVRDA.menu.95_bootloader.21_UART1_C0_LC6_SC7_Curiosity.bootloader.file=hex/boot_avrdx_UART1_C0_{upload.speed}_LC6.hex
AVRDA.menu.95_bootloader.21_UART1_C0_LC6_SC7_Curiosity.build.console_select=-DSerial=Serial1A -DLED_BUILTIN=PIN_PC6 -DSW_BUILTIN=PIN_PC7
AVRDA.menu.95_bootloader.21_UART1_C0_LC6_SC7_Curiosity=UART1 TX:PC0 RX:PC1 LED=PC6 SW=PC7 (AVR128DA48 Curiosity Nano)


