askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDD.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDD.bootloader.OSCCFG=0x00
AVRDD.bootloader.PINCFG=0x00
AVRDD.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}00{bootloader.eesave_bit}
AVRDD.bootloader.SYSCFG1=0b000{bootloader.mvsys_bit}000
AVRDD.bootloader.CODESIZE=0x00
AVRDD.bootloader.BOOTSIZE=0x01
AVRDD.bootloader.bod_lvl=000
AVRDD.bootloader.bod_mode=00
AVRDD.bootloader.bod_sample=0
AVRDD.bootloader.eepupload=
AVRDD.bootloader.browupload=
AVRDD.bootloader.urowupload=
AVRDD.bootloader.fuseupload={bootloader.fuses}
AVRDD.bootloader.eesave_bit=1
AVRDD.bootloader.mvsys_bit=01
AVRDD.bootloader.reset_bit=1
AVRDD.bootloader.updi_bit=1
AVRDD.bootloader.tool=avrdude
AVRDD.bootloader.programed_type=.with_bootloader
AVRDD.build.export_merged_output=true
AVRDD.build.text_section_start=.text=0x200
AVRDD.build.buildopt=-DNDEBUG
AVRDD.build.console_baud=-DCONSOLE_BAUD=9600
AVRDD.build.macroapi=-DENABLE_MACRO_API
AVRDD.build.printf=
AVRDD.build.printflt=
AVRDD.build.f_cpu=24000000L
AVRDD.compiler.ldflags=
AVRDD.compiler.c.elf.extra_flags=
AVRDD.upload.protocol=arduino
AVRDD.upload.speed=115200
AVRDD.upload.tool=avrdude
AVRDD.menu.01_variant.22_AVR64DD32.build.board=AVR_AVR64DD32
AVRDD.menu.01_variant.22_AVR64DD32.build.mcu=avr64dd32
AVRDD.menu.01_variant.22_AVR64DD32.build.variant=avr_dd32
AVRDD.menu.01_variant.22_AVR64DD32.build.linker_script=avrxmega2_p512.x
AVRDD.menu.01_variant.22_AVR64DD32.upload.maximum_data_size=8192
AVRDD.menu.01_variant.22_AVR64DD32.upload.maximum_size=65024
AVRDD.menu.01_variant.22_AVR64DD32=32pin AVR64DD32 (64KiB+8KiB)
AVRDD.menu.01_variant.23_AVR32DD32.build.board=AVR_AVR32DD32
AVRDD.menu.01_variant.23_AVR32DD32.build.mcu=avr32dd32
AVRDD.menu.01_variant.23_AVR32DD32.build.variant=avr_dd32
AVRDD.menu.01_variant.23_AVR32DD32.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.23_AVR32DD32.upload.maximum_data_size=4096
AVRDD.menu.01_variant.23_AVR32DD32.upload.maximum_size=32256
AVRDD.menu.01_variant.23_AVR32DD32=32pin AVR32DD32 (32KiB+4KiB)
AVRDD.menu.01_variant.24_AVR16DD32.build.board=AVR_AVR16DD32
AVRDD.menu.01_variant.24_AVR16DD32.build.mcu=avr16dd32
AVRDD.menu.01_variant.24_AVR16DD32.build.variant=avr_dd32
AVRDD.menu.01_variant.24_AVR16DD32.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.24_AVR16DD32.upload.maximum_data_size=2048
AVRDD.menu.01_variant.24_AVR16DD32.upload.maximum_size=15872
AVRDD.menu.01_variant.24_AVR16DD32=32pin AVR16DD32 (16KiB+2KiB)
AVRDD.menu.01_variant.30_separator=-
AVRDD.menu.01_variant.32_AVR64DD28.build.board=AVR_AVR64DD28
AVRDD.menu.01_variant.32_AVR64DD28.build.mcu=avr64dd28
AVRDD.menu.01_variant.32_AVR64DD28.build.variant=avr_dd28
AVRDD.menu.01_variant.32_AVR64DD28.build.linker_script=avrxmega2_p512.x
AVRDD.menu.01_variant.32_AVR64DD28.upload.maximum_data_size=8192
AVRDD.menu.01_variant.32_AVR64DD28.upload.maximum_size=65024
AVRDD.menu.01_variant.32_AVR64DD28=28pin AVR64DD28 (64KiB+8KiB)
AVRDD.menu.01_variant.33_AVR32DD28.build.board=AVR_AVR32DD28
AVRDD.menu.01_variant.33_AVR32DD28.build.mcu=avr32dd28
AVRDD.menu.01_variant.33_AVR32DD28.build.variant=avr_dd28
AVRDD.menu.01_variant.33_AVR32DD28.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.33_AVR32DD28.upload.maximum_data_size=4096
AVRDD.menu.01_variant.33_AVR32DD28.upload.maximum_size=32256
AVRDD.menu.01_variant.33_AVR32DD28=28pin AVR32DD28 (32KiB+4KiB)
AVRDD.menu.01_variant.34_AVR16DD28.build.board=AVR_AVR16DD28
AVRDD.menu.01_variant.34_AVR16DD28.build.mcu=avr16dd28
AVRDD.menu.01_variant.34_AVR16DD28.build.variant=avr_dd28
AVRDD.menu.01_variant.34_AVR16DD28.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.34_AVR16DD28.upload.maximum_data_size=2048
AVRDD.menu.01_variant.34_AVR16DD28.upload.maximum_size=15872
AVRDD.menu.01_variant.34_AVR16DD28=28pin AVR16DD28 (16KiB+2KiB)
AVRDD.menu.01_variant.40_separator=-
AVRDD.menu.01_variant.42_AVR64DD20.build.board=AVR_AVR64DD20
AVRDD.menu.01_variant.42_AVR64DD20.build.mcu=avr64dd20
AVRDD.menu.01_variant.42_AVR64DD20.build.variant=avr_dd20
AVRDD.menu.01_variant.42_AVR64DD20.build.linker_script=avrxmega2_p512.x
AVRDD.menu.01_variant.42_AVR64DD20.upload.maximum_data_size=8192
AVRDD.menu.01_variant.42_AVR64DD20.upload.maximum_size=65024
AVRDD.menu.01_variant.42_AVR64DD20=20pin AVR64DD20 (64KiB+8KiB)
AVRDD.menu.01_variant.43_AVR32DD20.build.board=AVR_AVR32DD20
AVRDD.menu.01_variant.43_AVR32DD20.build.mcu=avr32dd20
AVRDD.menu.01_variant.43_AVR32DD20.build.variant=avr_dd20
AVRDD.menu.01_variant.43_AVR32DD20.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.43_AVR32DD20.upload.maximum_data_size=4096
AVRDD.menu.01_variant.43_AVR32DD20.upload.maximum_size=32256
AVRDD.menu.01_variant.43_AVR32DD20=20pin AVR32DD20 (32KiB+4KiB)
AVRDD.menu.01_variant.44_AVR16DD20.build.board=AVR_AVR16DD20
AVRDD.menu.01_variant.44_AVR16DD20.build.mcu=avr16dd20
AVRDD.menu.01_variant.44_AVR16DD20.build.variant=avr_dd20
AVRDD.menu.01_variant.44_AVR16DD20.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.44_AVR16DD20.upload.maximum_data_size=2048
AVRDD.menu.01_variant.44_AVR16DD20.upload.maximum_size=15872
AVRDD.menu.01_variant.44_AVR16DD20=20pin AVR16DD20 (16KiB+2KiB)
AVRDD.menu.01_variant.50_separator=-
AVRDD.menu.01_variant.52_AVR64DD14.build.board=AVR_AVR64DD14
AVRDD.menu.01_variant.52_AVR64DD14.build.mcu=avr64dd14
AVRDD.menu.01_variant.52_AVR64DD14.build.variant=avr_dd14
AVRDD.menu.01_variant.52_AVR64DD14.build.linker_script=avrxmega2_p512.x
AVRDD.menu.01_variant.52_AVR64DD14.upload.maximum_data_size=8192
AVRDD.menu.01_variant.52_AVR64DD14.upload.maximum_size=65024
AVRDD.menu.01_variant.52_AVR64DD14=14pin AVR64DD14 (64KiB+8KiB)
AVRDD.menu.01_variant.53_AVR32DD14.build.board=AVR_AVR32DD14
AVRDD.menu.01_variant.53_AVR32DD14.build.mcu=avr32dd14
AVRDD.menu.01_variant.53_AVR32DD14.build.variant=avr_dd14
AVRDD.menu.01_variant.53_AVR32DD14.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.53_AVR32DD14.upload.maximum_data_size=4096
AVRDD.menu.01_variant.53_AVR32DD14.upload.maximum_size=32256
AVRDD.menu.01_variant.53_AVR32DD14=14pin AVR32DD14 (32KiB+4KiB)
AVRDD.menu.01_variant.54_AVR16DD14.build.board=AVR_AVR16DD14
AVRDD.menu.01_variant.54_AVR16DD14.build.mcu=avr16dd14
AVRDD.menu.01_variant.54_AVR16DD14.build.variant=avr_dd14
AVRDD.menu.01_variant.54_AVR16DD14.build.linker_script=avrxmega3_p512.x
AVRDD.menu.01_variant.54_AVR16DD14.upload.maximum_data_size=2048
AVRDD.menu.01_variant.54_AVR16DD14.upload.maximum_size=15872
AVRDD.menu.01_variant.54_AVR16DD14=14pin AVR16DD14 (16KiB+2KiB)
AVRDD.menu.02_clock.01_24MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.01_24MHz.build.f_cpu=24000000L
AVRDD.menu.02_clock.01_24MHz=Internal 24 MHz (default)
AVRDD.menu.02_clock.01_12MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.01_12MHz.build.f_cpu=12000000L
AVRDD.menu.02_clock.01_12MHz=Internal 12 MHz
AVRDD.menu.02_clock.03_6MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.03_6MHz.build.f_cpu=6000000L
AVRDD.menu.02_clock.03_6MHz=Internal 6 MHz
AVRDD.menu.02_clock.04_3MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.04_3MHz.build.f_cpu=3000000L
AVRDD.menu.02_clock.04_3MHz=Internal 3 MHz
AVRDD.menu.02_clock.10_separator=-
AVRDD.menu.02_clock.11_20MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.11_20MHz.build.f_cpu=20000000L
AVRDD.menu.02_clock.11_20MHz=Internal 20 MHz
AVRDD.menu.02_clock.12_10MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.12_10MHz.build.f_cpu=10000000L
AVRDD.menu.02_clock.12_10MHz=Internal 10 MHz
AVRDD.menu.02_clock.13_5MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.13_5MHz.build.f_cpu=5000000L
AVRDD.menu.02_clock.13_5MHz=Internal 5 MHz
AVRDD.menu.02_clock.20_separator=-
AVRDD.menu.02_clock.21_16MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.21_16MHz.build.f_cpu=16000000L
AVRDD.menu.02_clock.21_16MHz=Internal 16 MHz
AVRDD.menu.02_clock.22_8MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.22_8MHz.build.f_cpu=8000000L
AVRDD.menu.02_clock.22_8MHz=Internal 8 MHz
AVRDD.menu.02_clock.23_4MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.23_4MHz.build.f_cpu=4000000L
AVRDD.menu.02_clock.23_4MHz=Internal 4 MHz
AVRDD.menu.02_clock.24_2MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.24_2MHz.build.f_cpu=2000000L
AVRDD.menu.02_clock.24_2MHz=Internal 2 MHz
AVRDD.menu.02_clock.25_1MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.25_1MHz.build.f_cpu=1000000L
AVRDD.menu.02_clock.25_1MHz=Internal 1 MHz
AVRDD.menu.02_clock.30_separator=-
AVRDD.menu.02_clock.31_32MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.31_32MHz.build.f_cpu=32000000L
AVRDD.menu.02_clock.31_32MHz=Internal 32 MHz (OVERCLOCK)
AVRDD.menu.02_clock.32_28MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.32_28MHz.build.f_cpu=28000000L
AVRDD.menu.02_clock.32_28MHz=Internal 28 MHz (OVERCLOCK)
AVRDD.menu.02_clock.33_14MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.33_14MHz.build.f_cpu=14000000L
AVRDD.menu.02_clock.33_14MHz=Internal 14 MHz (OVERCLOCK)
AVRDD.menu.02_clock.34_7MHz.bootloader.bod_sample=0
AVRDD.menu.02_clock.34_7MHz.build.f_cpu=7000000L
AVRDD.menu.02_clock.34_7MHz=Internal 7 MHz (OVERCLOCK)
AVRDD.menu.02_clock.40_separator=-
AVRDD.menu.02_clock.41_32768Hz.bootloader.bod_sample=1
AVRDD.menu.02_clock.41_32768Hz.build.f_cpu=32256
AVRDD.menu.02_clock.41_32768Hz=Internal 32.768 kHz (ULP)
# AVRDD.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
# AVRDD.menu.11_BODMODE.01_disabled=BOD Disabled
# AVRDD.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
# AVRDD.menu.11_BODMODE.02_enabled=BOD Enabled
# AVRDD.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
# AVRDD.menu.11_BODMODE.03_sampled=BOD Sampled
# AVRDD.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
# AVRDD.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
# AVRDD.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRDD.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRDD.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRDD.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRDD.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRDD.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRDD.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRDD.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVRDD.menu.21_resetpin.01_reset.bootloader.reset_bit=1
AVRDD.menu.21_resetpin.01_reset=Reset
AVRDD.menu.21_resetpin.02_gpio.bootloader.reset_bit=0
AVRDD.menu.21_resetpin.02_gpio=GPIO (input only)
# AVRDD.menu.22_updipin.01_updi.bootloader.updi_bit=1
# AVRDD.menu.22_updipin.01_updi=PF7 pin=UPDI (default)
# AVRDD.menu.22_updipin.02_gpio.bootloader.updi_bit=0
# AVRDD.menu.22_updipin.02_gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)
AVRDD.menu.23_mvsyscfg.01_dual.bootloader.mvsys_bit=01
AVRDD.menu.23_mvsyscfg.01_dual=MVIO "Dual" (default)
AVRDD.menu.23_mvsyscfg.02_single.bootloader.mvsys_bit=10
AVRDD.menu.23_mvsyscfg.02_single=MVIO "Single"
AVRDD.menu.24_eeprom.01_keep.bootloader.eesave_bit=1
AVRDD.menu.24_eeprom.01_keep=Save guard "Retained"
AVRDD.menu.24_eeprom.02_erase.bootloader.eesave_bit=0
AVRDD.menu.24_eeprom.02_erase=Save guard "Erase"
AVRDD.menu.24_eeprom.03_upload.bootloader.eepupload={bootloader.eeprom}
AVRDD.menu.24_eeprom.03_upload.bootloader.eesave_bit=1
AVRDD.menu.24_eeprom.03_upload=Upload ".eep" file
AVRDD.menu.26_userrow.02_keep=Save guard "Retained"
AVRDD.menu.26_userrow.03_upload.bootloader.urowupload={bootloader.userrow}
AVRDD.menu.26_userrow.03_upload=Upload ".urow" file
AVRDD.menu.51_buildopt.01_Release=Build Release (default)
AVRDD.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRDD.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRDD.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRDD.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRDD.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRDD.menu.52_macroapi.02_Withoutboot.compiler.ldflags=-nostartfiles -DWOSFILES=1
AVRDD.menu.52_macroapi.02_Withoutboot=Macro API Enable without startup
AVRDD.menu.52_macroapi.03_Disable.build.macroapi=
AVRDD.menu.52_macroapi.03_Disable=Macro API Disable
AVRDD.menu.52_macroapi.04_AllDisable.build.macroapi=
AVRDD.menu.52_macroapi.04_AllDisable.compiler.ldflags=-nostartfiles -nostdlib -DWOSFILES=1 -DWOSTDLIB=1
AVRDD.menu.52_macroapi.04_AllDisable=Standard Library All Disable
AVRDD.menu.53_printf.01_default=default
AVRDD.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRDD.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDD.menu.53_printf.02_full=Float Support
AVRDD.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDD.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVRDD.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDD.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVRDD.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDD.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVRDD.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDD.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVRDD.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDD.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVRDD.menu.90_console_baud.14_500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDD.menu.90_console_baud.14_500000bps=CONSOLE_BAUD=500000 bps
AVRDD.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDD.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVRDD.menu.90_console_baud.20_separator=-
AVRDD.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDD.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVRDD.menu.95_bootloader.01_UART0_A0_LA7.bootloader.file=hex/boot_avrdd_UART0_A0_{upload.speed}_LA7.hex
AVRDD.menu.95_bootloader.01_UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRDD.menu.95_bootloader.01_UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7
AVRDD.menu.95_bootloader.10_separator=-
AVRDD.menu.95_bootloader.11_UART0_D4_LC3.bootloader.file=hex/boot_avrdd_UART0_D4_{upload.speed}_LC3.hex
AVRDD.menu.95_bootloader.11_UART0_D4_LC3.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PC3
AVRDD.menu.95_bootloader.11_UART0_D4_LC3=UART0 TX:PD4 RX:PD5 LED=PC3 (14pin)
AVRDD.menu.95_bootloader.12_UART1_D6_LC3.bootloader.file=hex/boot_avrdd_UART1_D6_{upload.speed}_LC3.hex
AVRDD.menu.95_bootloader.12_UART1_D6_LC3.build.console_select=-DSerial=Serial1C -DLED_BUILTIN=PIN_PC3
AVRDD.menu.95_bootloader.12_UART1_D6_LC3=UART1 TX:PD6 RX:PD7 LED=PC3 (14pin)
AVRDD.menu.95_bootloader.20_separator=-
AVRDD.menu.95_bootloader.21_UART0_D4_LF5_SF6_Curiosity.bootloader.file=hex/boot_avrdd_UART0_D4_{upload.speed}_LF5.hex
AVRDD.menu.95_bootloader.21_UART0_D4_LF5_SF6_Curiosity.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PF6
AVRDD.menu.95_bootloader.21_UART0_D4_LF5_SF6_Curiosity=UART0 TX:PD4 RX:PD5 LED=PF5 SW=PF6 (AVR64DD32 Curiosity Nano)


