askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDU_usbloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDU_usbloader.bootloader.OSCCFG=0x00
AVRDU_usbloader.bootloader.PINCFG=0x00
AVRDU_usbloader.bootloader.SYSCFG0=0b111{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.browsave_bit}{bootloader.eesave_bit}
AVRDU_usbloader.bootloader.SYSCFG1=0b000{bootloader.usbsink_bit}000
AVRDU_usbloader.bootloader.CODESIZE=0x00
AVRDU_usbloader.bootloader.BOOTSIZE=0x05
AVRDU_usbloader.bootloader.bod_lvl=000
AVRDU_usbloader.bootloader.bod_mode=00
AVRDU_usbloader.bootloader.bod_sample=0
AVRDU_usbloader.bootloader.eepupload=
AVRDU_usbloader.bootloader.browupload=
AVRDU_usbloader.bootloader.urowupload=
AVRDU_usbloader.bootloader.fuseupload={bootloader.fuses}
AVRDU_usbloader.bootloader.eesave_bit=1
AVRDU_usbloader.bootloader.browsave_bit=1
AVRDU_usbloader.bootloader.usbsink_bit=01
AVRDU_usbloader.bootloader.reset_bit=0
AVRDU_usbloader.bootloader.updi_bit=1
AVRDU_usbloader.bootloader.tool=avrdude
AVRDU_usbloader.bootloader.programed_type=.with_bootloader
AVRDU_usbloader.build.export_merged_output=true
AVRDU_usbloader.build.text_section_start=.text=0xA00
AVRDU_usbloader.build.buildopt=-DNDEBUG
AVRDU_usbloader.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU_usbloader.build.console_select=-DSerial=SerialUSB
AVRDU_usbloader.build.macroapi=-DENABLE_MACRO_API
AVRDU_usbloader.build.enableusb=-DENABLE_USBLOADER
AVRDU_usbloader.build.printf=
AVRDU_usbloader.build.printflt=
AVRDU_usbloader.build.f_cpu=20000000L
AVRDU_usbloader.compiler.ldflags=
AVRDU_usbloader.compiler.c.elf.extra_flags=
AVRDU_usbloader.upload.protocol=jtag3updi -Pusb:04D8:0B12
AVRDU_usbloader.upload.use_1200bps_touch=true
AVRDU_usbloader.upload.tool=avrdude_usb
AVRDU_usbloader.menu.01_variant.22_AVR64DU32.build.board=AVR_AVR64DU32
AVRDU_usbloader.menu.01_variant.22_AVR64DU32.build.mcu=avr64du32
AVRDU_usbloader.menu.01_variant.22_AVR64DU32.build.variant=avr_du32
AVRDU_usbloader.menu.01_variant.22_AVR64DU32.build.linker_script=avrxmega2_p512.x
AVRDU_usbloader.menu.01_variant.22_AVR64DU32.upload.maximum_data_size=8192
AVRDU_usbloader.menu.01_variant.22_AVR64DU32.upload.maximum_size=62976
AVRDU_usbloader.menu.01_variant.22_AVR64DU32=32pin AVR64DU32 (64KiB+8KiB)
AVRDU_usbloader.menu.01_variant.23_AVR32DU32.build.board=AVR_AVR32DU32
AVRDU_usbloader.menu.01_variant.23_AVR32DU32.build.mcu=avr32du32
AVRDU_usbloader.menu.01_variant.23_AVR32DU32.build.variant=avr_du32
AVRDU_usbloader.menu.01_variant.23_AVR32DU32.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.23_AVR32DU32.upload.maximum_data_size=4096
AVRDU_usbloader.menu.01_variant.23_AVR32DU32.upload.maximum_size=30208
AVRDU_usbloader.menu.01_variant.23_AVR32DU32=32pin AVR32DU32 (32KiB+4KiB)
AVRDU_usbloader.menu.01_variant.24_AVR16DU32.build.board=AVR_AVR16DU32
AVRDU_usbloader.menu.01_variant.24_AVR16DU32.build.mcu=avr16du32
AVRDU_usbloader.menu.01_variant.24_AVR16DU32.build.variant=avr_du32
AVRDU_usbloader.menu.01_variant.24_AVR16DU32.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.24_AVR16DU32.upload.maximum_data_size=2048
AVRDU_usbloader.menu.01_variant.24_AVR16DU32.upload.maximum_size=13824
AVRDU_usbloader.menu.01_variant.24_AVR16DU32=32pin AVR16DU32 (16KiB+2KiB)
AVRDU_usbloader.menu.01_variant.30_separator=-
AVRDU_usbloader.menu.01_variant.32_AVR64DU28.build.board=AVR_AVR64DU28
AVRDU_usbloader.menu.01_variant.32_AVR64DU28.build.mcu=avr64du28
AVRDU_usbloader.menu.01_variant.32_AVR64DU28.build.variant=avr_du28
AVRDU_usbloader.menu.01_variant.32_AVR64DU28.build.linker_script=avrxmega2_p512.x
AVRDU_usbloader.menu.01_variant.32_AVR64DU28.upload.maximum_data_size=8192
AVRDU_usbloader.menu.01_variant.32_AVR64DU28.upload.maximum_size=62976
AVRDU_usbloader.menu.01_variant.32_AVR64DU28=28pin AVR64DU28 (64KiB+8KiB)
AVRDU_usbloader.menu.01_variant.33_AVR32DU28.build.board=AVR_AVR32DU28
AVRDU_usbloader.menu.01_variant.33_AVR32DU28.build.mcu=avr32du28
AVRDU_usbloader.menu.01_variant.33_AVR32DU28.build.variant=avr_du28
AVRDU_usbloader.menu.01_variant.33_AVR32DU28.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.33_AVR32DU28.upload.maximum_data_size=4096
AVRDU_usbloader.menu.01_variant.33_AVR32DU28.upload.maximum_size=30208
AVRDU_usbloader.menu.01_variant.33_AVR32DU28=28pin AVR32DU28 (32KiB+4KiB)
AVRDU_usbloader.menu.01_variant.34_AVR16DU28.build.board=AVR_AVR16DU28
AVRDU_usbloader.menu.01_variant.34_AVR16DU28.build.mcu=avr16du28
AVRDU_usbloader.menu.01_variant.34_AVR16DU28.build.variant=avr_du28
AVRDU_usbloader.menu.01_variant.34_AVR16DU28.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.34_AVR16DU28.upload.maximum_data_size=2048
AVRDU_usbloader.menu.01_variant.34_AVR16DU28.upload.maximum_size=13824
AVRDU_usbloader.menu.01_variant.34_AVR16DU28=28pin AVR16DU28 (16KiB+2KiB)
AVRDU_usbloader.menu.01_variant.40_separator=-
AVRDU_usbloader.menu.01_variant.43_AVR32DU20.build.board=AVR_AVR32DU20
AVRDU_usbloader.menu.01_variant.43_AVR32DU20.build.mcu=avr32dU20
AVRDU_usbloader.menu.01_variant.43_AVR32DU20.build.variant=avr_dU20
AVRDU_usbloader.menu.01_variant.43_AVR32DU20.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.43_AVR32DU20.upload.maximum_data_size=4096
AVRDU_usbloader.menu.01_variant.43_AVR32DU20.upload.maximum_size=30208
AVRDU_usbloader.menu.01_variant.43_AVR32DU20=20pin AVR32DU20 (32KiB+4KiB)
AVRDU_usbloader.menu.01_variant.44_AVR16DU20.build.board=AVR_AVR16DU20
AVRDU_usbloader.menu.01_variant.44_AVR16DU20.build.mcu=avr16du20
AVRDU_usbloader.menu.01_variant.44_AVR16DU20.build.variant=avr_du20
AVRDU_usbloader.menu.01_variant.44_AVR16DU20.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.44_AVR16DU20.upload.maximum_data_size=2048
AVRDU_usbloader.menu.01_variant.44_AVR16DU20.upload.maximum_size=13824
AVRDU_usbloader.menu.01_variant.44_AVR16DU20=20pin AVR16DU20 (16KiB+2KiB)
AVRDU_usbloader.menu.01_variant.50_separator=-
AVRDU_usbloader.menu.01_variant.53_AVR32DU14.build.board=AVR_AVR32DU14
AVRDU_usbloader.menu.01_variant.53_AVR32DU14.build.mcu=avr32du14
AVRDU_usbloader.menu.01_variant.53_AVR32DU14.build.variant=avr_du14
AVRDU_usbloader.menu.01_variant.53_AVR32DU14.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.53_AVR32DU14.upload.maximum_data_size=4096
AVRDU_usbloader.menu.01_variant.53_AVR32DU14.upload.maximum_size=30208
AVRDU_usbloader.menu.01_variant.53_AVR32DU14=14pin AVR32DU14 (32KiB+4KiB)
AVRDU_usbloader.menu.01_variant.54_AVR16DU14.build.board=AVR_AVR16DU14
AVRDU_usbloader.menu.01_variant.54_AVR16DU14.build.mcu=avr16du14
AVRDU_usbloader.menu.01_variant.54_AVR16DU14.build.variant=avr_du14
AVRDU_usbloader.menu.01_variant.54_AVR16DU14.build.linker_script=avrxmega3_p512.x
AVRDU_usbloader.menu.01_variant.54_AVR16DU14.upload.maximum_data_size=2048
AVRDU_usbloader.menu.01_variant.54_AVR16DU14.upload.maximum_size=13824
AVRDU_usbloader.menu.01_variant.54_AVR16DU14=14pin AVR16DU14 (16KiB+2KiB)
AVRDU_usbloader.menu.02_clock.01_24MHz.bootloader.bod_sample=0
AVRDU_usbloader.menu.02_clock.01_24MHz.build.f_cpu=24000000L
AVRDU_usbloader.menu.02_clock.01_24MHz=Internal 24 MHz (default)
AVRDU_usbloader.menu.02_clock.01_12MHz.bootloader.bod_sample=0
AVRDU_usbloader.menu.02_clock.01_12MHz.build.f_cpu=12000000L
AVRDU_usbloader.menu.02_clock.01_12MHz=Internal 12 MHz (The lowest limit for using USB peripherals)
# AVRDU_usbloader.menu.02_clock.03_6MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.03_6MHz.build.f_cpu=6000000L
# AVRDU_usbloader.menu.02_clock.03_6MHz=Internal 6 MHz
# AVRDU_usbloader.menu.02_clock.04_3MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.04_3MHz.build.f_cpu=3000000L
# AVRDU_usbloader.menu.02_clock.04_3MHz=Internal 3 MHz
# AVRDU_usbloader.menu.02_clock.10_separator=-
AVRDU_usbloader.menu.02_clock.11_20MHz.bootloader.bod_sample=0
AVRDU_usbloader.menu.02_clock.11_20MHz.build.f_cpu=20000000L
AVRDU_usbloader.menu.02_clock.11_20MHz=Internal 20 MHz (recommend)
# AVRDU_usbloader.menu.02_clock.12_10MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.12_10MHz.build.f_cpu=10000000L
# AVRDU_usbloader.menu.02_clock.12_10MHz=Internal 10 MHz
# AVRDU_usbloader.menu.02_clock.13_5MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.13_5MHz.build.f_cpu=5000000L
# AVRDU_usbloader.menu.02_clock.13_5MHz=Internal 5 MHz
# AVRDU_usbloader.menu.02_clock.20_separator=-
AVRDU_usbloader.menu.02_clock.21_16MHz.bootloader.bod_sample=0
AVRDU_usbloader.menu.02_clock.21_16MHz.build.f_cpu=16000000L
AVRDU_usbloader.menu.02_clock.21_16MHz=Internal 16 MHz
# AVRDU_usbloader.menu.02_clock.22_8MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.22_8MHz.build.f_cpu=8000000L
# AVRDU_usbloader.menu.02_clock.22_8MHz=Internal 8 MHz
# AVRDU_usbloader.menu.02_clock.23_4MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.23_4MHz.build.f_cpu=4000000L
# AVRDU_usbloader.menu.02_clock.23_4MHz=Internal 4 MHz
# AVRDU_usbloader.menu.02_clock.24_2MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.24_2MHz.build.f_cpu=2000000L
# AVRDU_usbloader.menu.02_clock.24_2MHz=Internal 2 MHz
# AVRDU_usbloader.menu.02_clock.25_1MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.25_1MHz.build.f_cpu=1000000L
# AVRDU_usbloader.menu.02_clock.25_1MHz=Internal 1 MHz
# AVRDU_usbloader.menu.02_clock.30_separator=-
# AVRDU_usbloader.menu.02_clock.31_32MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.31_32MHz.build.f_cpu=32000000L
# AVRDU_usbloader.menu.02_clock.31_32MHz=Internal 32 MHz (OVERCLOCK)
# AVRDU_usbloader.menu.02_clock.32_28MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.32_28MHz.build.f_cpu=28000000L
# AVRDU_usbloader.menu.02_clock.32_28MHz=Internal 28 MHz (OVERCLOCK)
# AVRDU_usbloader.menu.02_clock.33_14MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.33_14MHz.build.f_cpu=14000000L
# AVRDU_usbloader.menu.02_clock.33_14MHz=Internal 14 MHz (OVERCLOCK)
# AVRDU_usbloader.menu.02_clock.34_7MHz.bootloader.bod_sample=0
# AVRDU_usbloader.menu.02_clock.34_7MHz.build.f_cpu=7000000L
# AVRDU_usbloader.menu.02_clock.34_7MHz=Internal 7 MHz (OVERCLOCK)
# AVRDU_usbloader.menu.02_clock.40_separator=-
# AVRDU_usbloader.menu.02_clock.41_32768Hz.bootloader.bod_sample=1
# AVRDU_usbloader.menu.02_clock.41_32768Hz.build.f_cpu=32256
# AVRDU_usbloader.menu.02_clock.41_32768Hz=Internal 32.768 kHz (ULP)
# AVRDU_usbloader.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
# AVRDU_usbloader.menu.11_BODMODE.01_disabled=BOD Disabled
# AVRDU_usbloader.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
# AVRDU_usbloader.menu.11_BODMODE.02_enabled=BOD Enabled
# AVRDU_usbloader.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
# AVRDU_usbloader.menu.11_BODMODE.03_sampled=BOD Sampled
# AVRDU_usbloader.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
# AVRDU_usbloader.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL1=Level 2.45V
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL2=Level 2.7V
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRDU_usbloader.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVRDU_usbloader.menu.21_resetpin.02_gpio.bootloader.reset_bit=0
AVRDU_usbloader.menu.21_resetpin.02_gpio=GPIO (PF6 enables USB boot)
AVRDU_usbloader.menu.21_resetpin.03_reset.bootloader.reset_bit=1
AVRDU_usbloader.menu.21_resetpin.03_reset=Reset
# AVRDU_usbloader.menu.22_updipin.01_updi.bootloader.updi_bit=1
# AVRDU_usbloader.menu.22_updipin.01_updi=PF7 pin=UPDI (default)
# AVRDU_usbloader.menu.22_updipin.02_gpio.bootloader.updi_bit=0
# AVRDU_usbloader.menu.22_updipin.02_gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)
AVRDU_usbloader.menu.24_eeprom.01_keep.bootloader.eesave_bit=1
AVRDU_usbloader.menu.24_eeprom.01_keep=Save guard "Retained"
AVRDU_usbloader.menu.24_eeprom.02_erase.bootloader.eesave_bit=0
AVRDU_usbloader.menu.24_eeprom.02_erase=Save guard "Erase"
AVRDU_usbloader.menu.24_eeprom.03_upload.bootloader.eepupload={bootloader.eeprom}
AVRDU_usbloader.menu.24_eeprom.03_upload.bootloader.eesave_bit=1
AVRDU_usbloader.menu.24_eeprom.03_upload=Upload ".eep" file
AVRDU_usbloader.menu.25_bootrow.01_keep.bootloader.browsave_bit=1
AVRDU_usbloader.menu.25_bootrow.01_keep=Save guard "Retained"
AVRDU_usbloader.menu.25_bootrow.02_erase.bootloader.browsave_bit=0
AVRDU_usbloader.menu.25_bootrow.02_erase=Save guard "Erase"
AVRDU_usbloader.menu.25_bootrow.03_upload.bootloader.browupload={bootloader.bootrow}
AVRDU_usbloader.menu.25_bootrow.03_upload=Upload ".brow" file
AVRDU_usbloader.menu.26_userrow.02_keep=Save guard "Retained"
AVRDU_usbloader.menu.26_userrow.03_upload.bootloader.urowupload={bootloader.userrow}
AVRDU_usbloader.menu.26_userrow.03_upload=Upload ".urow" file
AVRDU_usbloader.menu.51_buildopt.01_Release=Build Release (default)
AVRDU_usbloader.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRDU_usbloader.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRDU_usbloader.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRDU_usbloader.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRDU_usbloader.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRDU_usbloader.menu.52_macroapi.02_Withoutboot.compiler.ldflags=-nostartfiles -DWOSFILES=1
AVRDU_usbloader.menu.52_macroapi.02_Withoutboot=Macro API Enable without startup
AVRDU_usbloader.menu.52_macroapi.03_Disable.build.macroapi=
AVRDU_usbloader.menu.52_macroapi.03_Disable=Macro API Disable
AVRDU_usbloader.menu.52_macroapi.04_AllDisable.build.macroapi=
AVRDU_usbloader.menu.52_macroapi.04_AllDisable.compiler.ldflags=-nostartfiles -nostdlib -DWOSFILES=1 -DWOSTDLIB=1
AVRDU_usbloader.menu.52_macroapi.04_AllDisable=Standard Library All Disable
AVRDU_usbloader.menu.53_printf.01_default=default
AVRDU_usbloader.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRDU_usbloader.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDU_usbloader.menu.53_printf.02_full=Float Support
AVRDU_usbloader.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDU_usbloader.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVRDU_usbloader.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDU_usbloader.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVRDU_usbloader.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDU_usbloader.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVRDU_usbloader.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDU_usbloader.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVRDU_usbloader.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDU_usbloader.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVRDU_usbloader.menu.90_console_baud.14_500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRDU_usbloader.menu.90_console_baud.14_500000bps=CONSOLE_BAUD=500000 bps
AVRDU_usbloader.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDU_usbloader.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVRDU_usbloader.menu.90_console_baud.20_separator=-
AVRDU_usbloader.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDU_usbloader.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVRDU_usbloader.menu.96_usbbootloader.01_euboot_LA7_SF6.bootloader.file=hex/euboot_LA7_SF6.hex
AVRDU_usbloader.menu.96_usbbootloader.01_euboot_LA7_SF6.build.console_select=-DSerial=SerialUSB -DSerialDBG=Serial0A -DLED_BUILTIN=PIN_PA7 -DSW_BUILTIN=PIN_PF6
AVRDU_usbloader.menu.96_usbbootloader.01_euboot_LA7_SF6=USB0 +UART0(PA0:1) LED=PA7 SW=PF6
AVRDU_usbloader.menu.96_usbbootloader.10_separator=-
AVRDU_usbloader.menu.96_usbbootloader.11_euboot_LC3_SF6.bootloader.file=hex/euboot_LC3_SF6.hex
AVRDU_usbloader.menu.96_usbbootloader.11_euboot_LC3_SF6.build.console_select=-DSerial=SerialUSB -DSerialDBG=Serial0D -DLED_BUILTIN=PIN_PC3 -DSW_BUILTIN=PIN_PF6
AVRDU_usbloader.menu.96_usbbootloader.11_euboot_LC3_SF6=USB0 +UART1(PD4:5) LED=PC3 SW=PF6 (14pin)
AVRDU_usbloader.menu.96_usbbootloader.20_separator=-
AVRDU_usbloader.menu.96_usbbootloader.21_euboot_LF2_SF6_Curiosity.bootloader.file=hex/euboot_LF2_SF6.hex
AVRDU_usbloader.menu.96_usbbootloader.21_euboot_LF2_SF6_Curiosity.build.console_select=-DSerial=SerialUSB -DSerialDBG=Serial1C -DLED_BUILTIN=PIN_PF2 -DSW_BUILTIN=PIN_PF6
AVRDU_usbloader.menu.96_usbbootloader.21_euboot_LF2_SF6_Curiosity=USB0 +UART1(PD6:7) LED=PF2 SW=PF6 (AVR64DU32 Curiosity Nano)


