askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRLA.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRLA.bootloader.OSCCFG=0x00
AVRLA.bootloader.PINCFG=0b000000{bootloader.updi_bit}{bootloader.reset_bit}
AVRLA.bootloader.SYSCFG0=0b000000{bootloader.browsave_bit}{bootloader.eesave_bit}
AVRLA.bootloader.SYSCFG1=0b00000111
AVRLA.bootloader.CODESIZE=0x00
AVRLA.bootloader.BOOTSIZE=0x02
AVRLA.bootloader.bod_lvl=000
AVRLA.bootloader.bod_mode=00
AVRLA.bootloader.bod_sample=0
AVRLA.bootloader.eepupload=
AVRLA.bootloader.browupload=
AVRLA.bootloader.urowupload=
AVRLA.bootloader.fuseupload={bootloader.fuses}
AVRLA.bootloader.eesave_bit=1
AVRLA.bootloader.browsave_bit=1
AVRLA.bootloader.reset_bit=1
AVRLA.bootloader.updi_bit=1
AVRLA.bootloader.tool=avrdude
AVRLA.bootloader.programed_type=.with_bootloader
AVRLA.build.export_merged_output=true
AVRLA.build.text_section_start=.text=0x200
AVRLA.build.buildopt=-DNDEBUG
AVRLA.build.console_baud=-DCONSOLE_BAUD=9600
AVRLA.build.macroapi=-DENABLE_MACRO_API
AVRLA.build.printf=
AVRLA.build.printflt=
AVRLA.build.f_cpu=20000000L
AVRLA.compiler.ldflags=
AVRLA.compiler.c.elf.extra_flags=
AVRLA.upload.protocol=arduino
AVRLA.upload.speed=115200
AVRLA.upload.tool=avrdude
AVRLA.menu.01_variant.23_AVR32LA32.build.board=AVR_AVR32LA32
AVRLA.menu.01_variant.23_AVR32LA32.build.mcu=avr32la32
AVRLA.menu.01_variant.23_AVR32LA32.build.variant=avr_la32
AVRLA.menu.01_variant.23_AVR32LA32.build.linker_script=avrxmega3_p64.x
AVRLA.menu.01_variant.23_AVR32LA32.upload.maximum_data_size=3072
AVRLA.menu.01_variant.23_AVR32LA32.upload.maximum_size=32256
AVRLA.menu.01_variant.23_AVR32LA32=32pin AVR32LA32 (32KiB+3KiB)
AVRLA.menu.01_variant.30_separator=-
AVRLA.menu.01_variant.33_AVR32LA28.build.board=AVR_AVR32LA28
AVRLA.menu.01_variant.33_AVR32LA28.build.mcu=avr32la28
AVRLA.menu.01_variant.33_AVR32LA28.build.variant=avr_la28
AVRLA.menu.01_variant.33_AVR32LA28.build.linker_script=avrxmega3_p64.x
AVRLA.menu.01_variant.33_AVR32LA28.upload.maximum_data_size=3072
AVRLA.menu.01_variant.33_AVR32LA28.upload.maximum_size=32256
AVRLA.menu.01_variant.33_AVR32LA28=28pin AVR32LA28 (32KiB+3KiB)
AVRLA.menu.01_variant.40_separator=-
AVRLA.menu.01_variant.43_AVR32LA20.build.board=AVR_AVR32LA20
AVRLA.menu.01_variant.43_AVR32LA20.build.mcu=avr32la20
AVRLA.menu.01_variant.43_AVR32LA20.build.variant=avr_la20
AVRLA.menu.01_variant.43_AVR32LA20.build.linker_script=avrxmega3_p64.x
AVRLA.menu.01_variant.43_AVR32LA20.upload.maximum_data_size=3072
AVRLA.menu.01_variant.43_AVR32LA20.upload.maximum_size=32256
AVRLA.menu.01_variant.43_AVR32LA20=20pin AVR32LA20 (32KiB+3KiB)
AVRLA.menu.01_variant.50_separator=-
AVRLA.menu.01_variant.53_AVR32LA14.build.board=AVR_AVR32LA14
AVRLA.menu.01_variant.53_AVR32LA14.build.mcu=avr32la14
AVRLA.menu.01_variant.53_AVR32LA14.build.variant=avr_la14
AVRLA.menu.01_variant.53_AVR32LA14.build.linker_script=avrxmega3_p64.x
AVRLA.menu.01_variant.53_AVR32LA14.upload.maximum_data_size=3072
AVRLA.menu.01_variant.53_AVR32LA14.upload.maximum_size=32256
AVRLA.menu.01_variant.53_AVR32LA14=14pin AVR32LA14 (32KiB+3KiB)
AVRLA.menu.03_clock.01_20MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.01_20MHz.build.f_cpu=20000000L
AVRLA.menu.03_clock.01_20MHz=Internal 20 MHz
AVRLA.menu.03_clock.02_10MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.02_10MHz.build.f_cpu=10000000L
AVRLA.menu.03_clock.02_10MHz=Internal 10 MHz
AVRLA.menu.03_clock.03_5MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.03_5MHz.build.f_cpu=5000000L
AVRLA.menu.03_clock.03_5MHz=Internal 5 MHz
AVRLA.menu.03_clock.10_separator=-
AVRLA.menu.03_clock.11_16MHz.bootloader.OSCCFG=0b00001000
AVRLA.menu.03_clock.11_16MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.11_16MHz.build.f_cpu=16000000L
AVRLA.menu.03_clock.11_16MHz=Internal 16 MHz
AVRLA.menu.03_clock.12_8MHz.bootloader.OSCCFG=0b00001000
AVRLA.menu.03_clock.12_8MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.12_8MHz.build.f_cpu=8000000L
AVRLA.menu.03_clock.12_8MHz=Internal 8 MHz
AVRLA.menu.03_clock.13_4MHz.bootloader.OSCCFG=0b00001000
AVRLA.menu.03_clock.13_4MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.13_4MHz.build.f_cpu=4000000L
AVRLA.menu.03_clock.13_4MHz=Internal 4 MHz
AVRLA.menu.03_clock.15_1MHz.bootloader.OSCCFG=0b00001000
AVRLA.menu.03_clock.15_1MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.15_1MHz.build.f_cpu=1000000L
AVRLA.menu.03_clock.15_1MHz=Internal 1 MHz
AVRLA.menu.03_clock.20_separator=-
AVRLA.menu.03_clock.21_2MHz.bootloader.bod_sample=0
AVRLA.menu.03_clock.21_2MHz.build.f_cpu=2000000L
AVRLA.menu.03_clock.21_2MHz=Internal 2 MHz
AVRLA.menu.03_clock.22_32768Hz.bootloader.bod_sample=1
AVRLA.menu.03_clock.22_32768Hz.build.f_cpu=32768
AVRLA.menu.03_clock.22_32768Hz=Internal 32.768 kHz (ULP)
# AVRLA.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
# AVRLA.menu.11_BODMODE.01_disabled=BOD Disabled
# AVRLA.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
# AVRLA.menu.11_BODMODE.02_enabled=BOD Enabled
# AVRLA.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
# AVRLA.menu.11_BODMODE.03_sampled=BOD Sampled
# AVRLA.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
# AVRLA.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
# AVRLA.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
# AVRLA.menu.12_BODLVL.BODLEVEL0=Level 1.65V (default)
# AVRLA.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
# AVRLA.menu.12_BODLVL.BODLEVEL1=Level 1.90V
# AVRLA.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
# AVRLA.menu.12_BODLVL.BODLEVEL2=Level 2.60V
# AVRLA.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
# AVRLA.menu.12_BODLVL.BODLEVEL3=Level 4.30V
AVRLA.menu.21_resetpin.01_reset.bootloader.reset_bit=1
AVRLA.menu.21_resetpin.01_reset=Reset
AVRLA.menu.21_resetpin.02_gpio.bootloader.reset_bit=0
AVRLA.menu.21_resetpin.02_gpio=GPIO (input only)
# AVRLA.menu.22_updipin.01_updi.bootloader.updi_bit=1
# AVRLA.menu.22_updipin.01_updi=PF7 pin=UPDI (default)
# AVRLA.menu.22_updipin.02_gpio.bootloader.updi_bit=0
# AVRLA.menu.22_updipin.02_gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)
AVRLA.menu.24_eeprom.01_keep.bootloader.eesave_bit=1
AVRLA.menu.24_eeprom.01_keep=Save guard "Retained"
AVRLA.menu.24_eeprom.02_erase.bootloader.eesave_bit=0
AVRLA.menu.24_eeprom.02_erase=Save guard "Erase"
AVRLA.menu.24_eeprom.03_upload.bootloader.eepupload={bootloader.eeprom}
AVRLA.menu.24_eeprom.03_upload.bootloader.eesave_bit=1
AVRLA.menu.24_eeprom.03_upload=Upload ".eep" file
AVRLA.menu.25_bootrow.01_keep.bootloader.browsave_bit=1
AVRLA.menu.25_bootrow.01_keep=Save guard "Retained"
AVRLA.menu.25_bootrow.02_erase.bootloader.browsave_bit=0
AVRLA.menu.25_bootrow.02_erase=Save guard "Erase"
AVRLA.menu.25_bootrow.03_upload.bootloader.browupload={bootloader.bootrow}
AVRLA.menu.25_bootrow.03_upload=Upload ".brow" file
AVRLA.menu.26_userrow.02_keep=Save guard "Retained"
AVRLA.menu.26_userrow.03_upload.bootloader.urowupload={bootloader.userrow}
AVRLA.menu.26_userrow.03_upload=Upload ".urow" file
AVRLA.menu.27_fusefile.01_menu=Specify in the MENU
AVRLA.menu.27_fusefile.03_upload.bootloader.fuseupload={bootloader.fusefile}
AVRLA.menu.27_fusefile.03_upload=Upload ".fuse" file (Use with caution)
AVRLA.menu.51_buildopt.01_Release=Build Release (default)
AVRLA.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRLA.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRLA.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRLA.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRLA.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRLA.menu.52_macroapi.02_Withoutboot.compiler.ldflags=-nostartfiles -DWOSFILES=1
AVRLA.menu.52_macroapi.02_Withoutboot=Macro API Enable without startup
AVRLA.menu.52_macroapi.03_Disable.build.macroapi=
AVRLA.menu.52_macroapi.03_Disable=Macro API Disable
AVRLA.menu.52_macroapi.04_AllDisable.build.macroapi=
AVRLA.menu.52_macroapi.04_AllDisable.compiler.ldflags=-nostartfiles -nostdlib -DWOSFILES=1 -DWOSTDLIB=1
AVRLA.menu.52_macroapi.04_AllDisable=Standard Library All Disable
AVRLA.menu.53_printf.01_default=default
AVRLA.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRLA.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRLA.menu.53_printf.02_full=Float Support
AVRLA.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRLA.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVRLA.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRLA.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVRLA.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRLA.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVRLA.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRLA.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVRLA.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRLA.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVRLA.menu.90_console_baud.14_500000bps.build.console_baud=-DCONSOLE_BAUD=500000
AVRLA.menu.90_console_baud.14_500000bps=CONSOLE_BAUD=500000 bps
AVRLA.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRLA.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVRLA.menu.90_console_baud.20_separator=-
AVRLA.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRLA.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVRLA.menu.95_bootloader.01_UART0_A0_LA7.bootloader.file=hex/boot_avrla_UART0_A0_{upload.speed}_LA7.hex
AVRLA.menu.95_bootloader.01_UART0_A0_LA7.build.console_select=-DSerial=Serial0A -DLED_BUILTIN=PIN_PA7
AVRLA.menu.95_bootloader.01_UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7
AVRLA.menu.95_bootloader.10_separator=-
AVRLA.menu.95_bootloader.12_UART0_D4_LC3.bootloader.file=hex/boot_avrla_UART0_D4_{upload.speed}_LC3.hex
AVRLA.menu.95_bootloader.12_UART0_D4_LC3.build.console_select=-DSerial=Serial0D -DLED_BUILTIN=PIN_PC3
AVRLA.menu.95_bootloader.12_UART0_D4_LC3=UART0 TX:PD4 RX:PD5 LED=PC3
AVRLA.menu.95_bootloader.20_separator=-
AVRLA.menu.95_bootloader.21_UART0_C1_LF5_SC0_Curiosity.bootloader.file=hex/boot_avrla_UART0_C1_{upload.speed}_LF5.hex
AVRLA.menu.95_bootloader.21_UART0_C1_LF5_SC0_Curiosity.build.console_select=-DSerial=Serial0E -DLED_BUILTIN=PIN_PF5 -DSW_BUILTIN=PIN_PC0
AVRLA.menu.95_bootloader.21_UART0_C1_LF5_SC0_Curiosity=UART0 TX:PC1 RX:PC2 LED=PF5 SW=PC0 (AVR32LA32 Curiosity Nano)


