askn37/multix-zinnia-sdk-modernAVR/boards.txt
CNANO.menu.51_buildopt.Release=Build Release (default)
CNANO.menu.51_buildopt.Debug1=Build DEBUG=1
CNANO.menu.51_buildopt.Debug1.build.buildopt=-DDEBUG=1
CNANO.menu.51_buildopt.Debug2=Build DEBUG=2
CNANO.menu.51_buildopt.Debug2.build.buildopt=-DDEBUG=2

CNANO.menu.52_macroapi.Enable=Macro API Enable (default)
CNANO.menu.52_macroapi.Withoutboot=Macro API Enable without startup
CNANO.menu.52_macroapi.Withoutboot.compiler.ldflags=-nostartfiles -DWOSFILES=1
CNANO.menu.52_macroapi.Disable=Macro API Disable
CNANO.menu.52_macroapi.Disable.build.macroapi=
CNANO.menu.52_macroapi.AllDisable=Standard Library All Disable
CNANO.menu.52_macroapi.AllDisable.build.macroapi=
CNANO.menu.52_macroapi.AllDisable.compiler.ldflags=-nostartfiles -nostdlib -DWOSFILES=1 -DWOSTDLIB=1

CNANO.menu.53_printf.default=default
CNANO.menu.53_printf.full.build.printf=-DUSE_PRINTF_FLT
CNANO.menu.53_printf.full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
CNANO.menu.53_printf.full=Float Support

CNANO.menu.90_console_baud.115200bps.build.console_baud=-DCONSOLE_BAUD=115200
CNANO.menu.90_console_baud.115200bps=CONSOLE_BAUD=115200 bps (default)
CNANO.menu.90_console_baud.230400bps.build.console_baud=-DCONSOLE_BAUD=230400
CNANO.menu.90_console_baud.230400bps=CONSOLE_BAUD=230400 bps
CNANO.menu.90_console_baud.460800bps.build.console_baud=-DCONSOLE_BAUD=460800
CNANO.menu.90_console_baud.460800bps=CONSOLE_BAUD=460800 bps
CNANO.menu.90_console_baud.9600bps.build.console_baud=-DCONSOLE_BAUD=9600
CNANO.menu.90_console_baud.9600bps=CONSOLE_BAUD=9600 bps
CNANO.menu.90_console_baud.38400bps.build.console_baud=-DCONSOLE_BAUD=38400
CNANO.menu.90_console_baud.38400bps=CONSOLE_BAUD=38400 bps
CNANO.menu.90_console_baud.57600bps.build.console_baud=-DCONSOLE_BAUD=57600
CNANO.menu.90_console_baud.57600bps=CONSOLE_BAUD=57600 bps
CNANO.menu.90_console_baud.500000bps.build.console_baud=-DCONSOLE_BAUD=500000
CNANO.menu.90_console_baud.500000bps=CONSOLE_BAUD=500000 bps
CNANO.menu.90_console_baud.1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
CNANO.menu.90_console_baud.1000000bps=CONSOLE_BAUD=1000000 bps
